- https://cloud.hasura.io/public/graphiql?endpoint=https://api.devnet.aptoslabs.com/v1/graphql

#+begin_src sh :results output :session share
export CONTRACT_ADDR="0x13cdb1a578713623dcd7ba67b1a08e8b42afc6ed2202bd25852994dd16344115"
export IDOL_ADDR="0x6810d5aef5501f19b43caab38913b21ec15f80dda557c66e85fad7b2c2580a7f"
export USER_ADDR="0x74a1c415a5b86d4e6631ccac107e1619535c5f68046f5404e69eacd94e54cb13"
#+end_src

#+RESULTS:

#+begin_src sh :results output :session share :async true
echo $CONTRACT_ADDR
echo $IDOL_ADDR
echo $USER_ADDR
echo $MACHINE_ADDR
#+end_src

#+RESULTS:
: 0x13cdb1a578713623dcd7ba67b1a08e8b42afc6ed2202bd25852994dd16344115
: 0x6810d5aef5501f19b43caab38913b21ec15f80dda557c66e85fad7b2c2580a7f
: 0x74a1c415a5b86d4e6631ccac107e1619535c5f68046f5404e69eacd94e54cb13
: 0x90af48901e1237a2cfe70b3b33c7d249d39916f8ab8016161ec87be462705edd

* Test CLI Flow
** Get Machine Address
#+begin_src sh :results output :session share :async true
aptos move view \
      --function-id "$CONTRACT_ADDR::only4fans::get_machine_address" \
      --args \
        address:$CONTRACT_ADDR
#+end_src

#+RESULTS:
: {
:   "Result": [
:     "0x90af48901e1237a2cfe70b3b33c7d249d39916f8ab8016161ec87be462705edd"
:   ]
: }

#+begin_src sh :results output :session share
export MACHINE_ADDR="0x90af48901e1237a2cfe70b3b33c7d249d39916f8ab8016161ec87be462705edd"
#+end_src

#+RESULTS:


** Idol Register
#+begin_src sh :results output :session share :async true
aptos move run \
      --function-id "$CONTRACT_ADDR::only4fans::idol_register" \
      --args \
        address:$MACHINE_ADDR \
        string:"Name" \
        string:"Username" \
        u8:160 \
        u8:60 \
        u16:1994 \
        string:"Bio" \
        string:"avatar" \
      --profile idol
#+end_src

#+RESULTS:
#+begin_example
Transaction submitted: https://explorer.aptoslabs.com/txn/0x8cf7b8206adf0eb5936bfd773cbb1a7e972d1575e9027fb89219f3d139e0cf26?network=devnet
{
  "Result": {
    "transaction_hash": "0x8cf7b8206adf0eb5936bfd773cbb1a7e972d1575e9027fb89219f3d139e0cf26",
    "gas_used": 474,
    "gas_unit_price": 100,
    "sender": "6810d5aef5501f19b43caab38913b21ec15f80dda557c66e85fad7b2c2580a7f",
    "sequence_number": 0,
    "success": true,
    "timestamp_us": 1743232706445213,
    "version": 175007089,
    "vm_status": "Executed successfully"
  }
}
#+end_example

#+begin_src sh :results output :session share
aptos account list --profile idol
#+end_src

#+RESULTS:
#+begin_example
{
  "Result": [
    {
      "0x1::account::Account": {
        "authentication_key": "0x6810d5aef5501f19b43caab38913b21ec15f80dda557c66e85fad7b2c2580a7f",
        "coin_register_events": {
          "counter": "0",
          "guid": {
            "id": {
              "addr": "0x6810d5aef5501f19b43caab38913b21ec15f80dda557c66e85fad7b2c2580a7f",
              "creation_num": "0"
            }
          }
        },
        "guid_creation_num": "4",
        "key_rotation_events": {
          "counter": "0",
          "guid": {
            "id": {
              "addr": "0x6810d5aef5501f19b43caab38913b21ec15f80dda557c66e85fad7b2c2580a7f",
              "creation_num": "1"
            }
          }
        },
        "rotation_capability_offer": {
          "for": {
            "vec": []
          }
        },
        "sequence_number": "2",
        "signer_capability_offer": {
          "for": {
            "vec": []
          }
        }
      }
    },
    {
      "0x13cdb1a578713623dcd7ba67b1a08e8b42afc6ed2202bd25852994dd16344115::only4fans::IdolInfo": {
        "all_collections": [
          "0x336167c2a558c9bdaa1b8c8253d14ab156127a471fbc75c8dc1d995fb62d7ef8"
        ],
        "avatar": "avatar",
        "bio": "Bio",
        "birthday_year": 1994,
        "height": 160,
        "name": "Name",
        "owner_addr": "0x6810d5aef5501f19b43caab38913b21ec15f80dda557c66e85fad7b2c2580a7f",
        "total_collections": "1",
        "total_fans": "0",
        "total_media": "0",
        "username": "Username",
        "weight": 60
      }
    },
    {
      "0x1::coin::CoinStore<0x1::aptos_coin::AptosCoin>": {
        "coin": {
          "value": "101029532"
        },
        "deposit_events": {
          "counter": "3",
          "guid": {
            "id": {
              "addr": "0x6810d5aef5501f19b43caab38913b21ec15f80dda557c66e85fad7b2c2580a7f",
              "creation_num": "2"
            }
          }
        },
        "frozen": false,
        "withdraw_events": {
          "counter": "0",
          "guid": {
            "id": {
              "addr": "0x6810d5aef5501f19b43caab38913b21ec15f80dda557c66e85fad7b2c2580a7f",
              "creation_num": "3"
            }
          }
        }
      }
    }
  ]
}
#+end_example

** Idol Create Collection
#+begin_src sh :results output :session share
aptos move run \
      --function-id "$CONTRACT_ADDR::only4fans::create_collection" \
      --args \
        string:"name2" \
        string:"description" \
        string:"uri" \
        u64:666666 \
      --profile idol
#+end_src

#+RESULTS:
#+begin_example
Transaction submitted: https://explorer.aptoslabs.com/txn/0x9a47ed28512ec11ec42b6378026ac97357ba4c48f5ddc770fb3b0837f008c491?network=devnet
{
  "Result": {
    "transaction_hash": "0x9a47ed28512ec11ec42b6378026ac97357ba4c48f5ddc770fb3b0837f008c491",
    "gas_used": 2564,
    "gas_unit_price": 100,
    "sender": "6810d5aef5501f19b43caab38913b21ec15f80dda557c66e85fad7b2c2580a7f",
    "sequence_number": 1,
    "success": true,
    "timestamp_us": 1743232736645846,
    "version": 175013689,
    "vm_status": "Executed successfully"
  }
}
#+end_example

** Get all collections
#+begin_src sh :results output :session share
aptos move view \
      --function-id "$CONTRACT_ADDR::only4fans::get_my_collections" \
      --args \
        address:$IDOL_ADDR
#+end_src

#+RESULTS:
: {
:   "Result": [
:     [
:       "0x336167c2a558c9bdaa1b8c8253d14ab156127a471fbc75c8dc1d995fb62d7ef8"
:     ]
:   ]
: }

#+begin_src sh :results output :session share
export COLLECTION_ADDR="0x336167c2a558c9bdaa1b8c8253d14ab156127a471fbc75c8dc1d995fb62d7ef8"
#+end_src

#+RESULTS:

#+begin_src sh :results output :session share
aptos account list --account $COLLECTION_ADDR
#+end_src

#+RESULTS:
#+begin_example
{
  "Result": [
    {
      "0x1::account::Account": {
        "authentication_key": "0x0000000000000000000000000000000000000000000000000000000000000000",
        "coin_register_events": {
          "counter": "0",
          "guid": {
            "id": {
              "addr": "0x336167c2a558c9bdaa1b8c8253d14ab156127a471fbc75c8dc1d995fb62d7ef8",
              "creation_num": "0"
            }
          }
        },
        "guid_creation_num": "2",
        "key_rotation_events": {
          "counter": "0",
          "guid": {
            "id": {
              "addr": "0x336167c2a558c9bdaa1b8c8253d14ab156127a471fbc75c8dc1d995fb62d7ef8",
              "creation_num": "1"
            }
          }
        },
        "rotation_capability_offer": {
          "for": {
            "vec": []
          }
        },
        "sequence_number": "0",
        "signer_capability_offer": {
          "for": {
            "vec": [
              "0x336167c2a558c9bdaa1b8c8253d14ab156127a471fbc75c8dc1d995fb62d7ef8"
            ]
          }
        }
      }
    },
    {
      "0x13cdb1a578713623dcd7ba67b1a08e8b42afc6ed2202bd25852994dd16344115::only4fans::CollectionInfo": {
        "collection": {
          "inner": "0x88fc0c661790e8a8520160104a9bb8dac79f2ade307ebcf9120307a4d3caf556"
        },
        "collection_address": "0x88fc0c661790e8a8520160104a9bb8dac79f2ade307ebcf9120307a4d3caf556",
        "idol_addr": "0x6810d5aef5501f19b43caab38913b21ec15f80dda557c66e85fad7b2c2580a7f",
        "post_minted": [],
        "price": "666666",
        "signer_cap": {
          "account": "0x336167c2a558c9bdaa1b8c8253d14ab156127a471fbc75c8dc1d995fb62d7ef8"
        },
        "users_payed": {
          "buckets": {
            "inner": {
              "handle": "0x8a05170b1be61a1dac2b573f9a58460932c8fbeb1ab1902c588ecd4a8eed3eb6"
            },
            "length": "2"
          },
          "level": 1,
          "num_buckets": "2",
          "size": "0",
          "split_load_threshold": 75,
          "target_bucket_size": "0"
        }
      }
    }
  ]
}
#+end_example


** Buy Collection
#+begin_src sh :results output :session share
aptos move run \
      --function-id "$CONTRACT_ADDR::only4fans::buy_collection" \
      --args \
        address:$COLLECTION_ADDR \
      --profile user
#+end_src

#+RESULTS:
#+begin_example
Transaction submitted: https://explorer.aptoslabs.com/txn/0xe20d84ac755520ecf744f9b09a3c62a8bd707ee2d954feef26913bae3661b307?network=devnet
{
  "Result": {
    "transaction_hash": "0xe20d84ac755520ecf744f9b09a3c62a8bd707ee2d954feef26913bae3661b307",
    "gas_used": 32,
    "gas_unit_price": 100,
    "sender": "74a1c415a5b86d4e6631ccac107e1619535c5f68046f5404e69eacd94e54cb13",
    "sequence_number": 0,
    "success": true,
    "timestamp_us": 1743232979650040,
    "version": 175067182,
    "vm_status": "Executed successfully"
  }
}
#+end_example

#+begin_src sh :results output :session share
aptos account list --profile user
#+end_src

#+RESULTS:
#+begin_example
{
  "Result": [
    {
      "0x1::account::Account": {
        "authentication_key": "0x74a1c415a5b86d4e6631ccac107e1619535c5f68046f5404e69eacd94e54cb13",
        "coin_register_events": {
          "counter": "0",
          "guid": {
            "id": {
              "addr": "0x74a1c415a5b86d4e6631ccac107e1619535c5f68046f5404e69eacd94e54cb13",
              "creation_num": "0"
            }
          }
        },
        "guid_creation_num": "4",
        "key_rotation_events": {
          "counter": "0",
          "guid": {
            "id": {
              "addr": "0x74a1c415a5b86d4e6631ccac107e1619535c5f68046f5404e69eacd94e54cb13",
              "creation_num": "1"
            }
          }
        },
        "rotation_capability_offer": {
          "for": {
            "vec": []
          }
        },
        "sequence_number": "1",
        "signer_capability_offer": {
          "for": {
            "vec": []
          }
        }
      }
    },
    {
      "0x1::coin::CoinStore<0x1::aptos_coin::AptosCoin>": {
        "coin": {
          "value": "99330134"
        },
        "deposit_events": {
          "counter": "1",
          "guid": {
            "id": {
              "addr": "0x74a1c415a5b86d4e6631ccac107e1619535c5f68046f5404e69eacd94e54cb13",
              "creation_num": "2"
            }
          }
        },
        "frozen": false,
        "withdraw_events": {
          "counter": "1",
          "guid": {
            "id": {
              "addr": "0x74a1c415a5b86d4e6631ccac107e1619535c5f68046f5404e69eacd94e54cb13",
              "creation_num": "3"
            }
          }
        }
      }
    }
  ]
}
#+end_example

** Check Permission
#+begin_src sh :results output :session share
aptos move view \
      --function-id "$CONTRACT_ADDR::only4fans::check_collection_permission" \
      --args \
        address:$COLLECTION_ADDR \
        address:$USER_ADDR
#+end_src

#+RESULTS:
: {
:   "Result": [
:     true
:   ]
: }
